In [54]:
import pandas as pd

In [55]:
df = pd.read_csv("data.csv")
df

,nik,nama,gender,usia,pendidikan,pekerjaan,status,kecamatan,penghasilan
0,3201010001,Andi Saputra,L,25,SMA,Karyawan Swasta,Belum Kawin,Ciputat,3500000.0
1,3201010002,Siti Aisyah,P,32,S1,Guru,Kawin,Pamulang,5500000.0
2,3201010003,Budi Santoso,L,45,SMA,Wiraswasta,Kawin,Serpong,7000000.0
3,3201010004,Rina Marlina,P,19,SMA,Mahasiswa,Belum Kawin,Ciputat,5000000.0
4,3201010005,Dedi Kurniawan,L,52,S1,PNS,Kawin,Serpong,8500000.0
5,3201010006,Lina Hartati,P,28,D3,Perawat,Kawin,Pamulang,4800000.0
6,3201010007,Rahmat Hidayat,L,35,SMA,Sopir,Kawin,Ciputat,4000000.0
7,3201010008,Nurul Fitri,P,16,SMP,Pelajar,Belum Kawin,Serpong,NaN
8,3201010009,Agus Pratama,L,60,SMA,Pensiunan,Kawin,Pamulang,3000000.0
9,3201010010,Dewi Lestari,P,41,S2,Dosen,Kawin,Ciputat,9000000.0
10,3201010011,Hendra Wijaya,L,22,SMA,Mahasiswa,Belum Kawin,Serpong,4000000.0
11,3201010012,Yuni Kartika,P,29,S1,HRD,Kawin,Pamulang,6000000.0

In [56]:
#menampilkan 5 data teratas
df.head()

,nik,nama,gender,usia,pendidikan,pekerjaan,status,kecamatan,penghasilan
0,3201010001,Andi Saputra,L,25,SMA,Karyawan Swasta,Belum Kawin,Ciputat,3500000.0
1,3201010002,Siti Aisyah,P,32,S1,Guru,Kawin,Pamulang,5500000.0
2,3201010003,Budi Santoso,L,45,SMA,Wiraswasta,Kawin,Serpong,7000000.0
3,3201010004,Rina Marlina,P,19,SMA,Mahasiswa,Belum Kawin,Ciputat,5000000.0
4,3201010005,Dedi Kurniawan,L,52,S1,PNS,Kawin,Serpong,8500000.0

In [57]:
#jumlah baris dan kolom
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nik          12 non-null     int64
 1   nama         12 non-null     object
 2   gender       12 non-null     object
 3   usia         12 non-null     int64
 4   pendidikan   12 non-null     object
 5   pekerjaan    12 non-null     object
 6   status       12 non-null     object
 7   kecamatan    12 non-null     object
 8   penghasilan  11 non-null     float64
dtypes: float64(1), int64(2), object(6)
memory usage: 996.0+ bytes

In [ ]:
#jumlah data
len(df)

12

In [64]:
#jumlah kolom
len(df.columns)

10

In [65]:
df.sort_values('usia', ascending=False)

,nik,nama,gender,usia,pendidikan,pekerjaan,status,kecamatan,penghasilan,umur
8,3201010009,Agus Pratama,L,60,SMA,Pensiunan,kawin,Pamulang,3000000.0,lansia
4,3201010005,Dedi Kurniawan,L,52,S1,PNS,kawin,Serpong,8500000.0,lansia
2,3201010003,Budi Santoso,L,45,SMA,Wiraswasta,kawin,Serpong,7000000.0,dewasa
9,3201010010,Dewi Lestari,P,41,S2,Dosen,kawin,Ciputat,9000000.0,dewasa
6,3201010007,Rahmat Hidayat,L,35,SMA,Sopir,kawin,Ciputat,4000000.0,dewasa
1,3201010002,Siti Aisyah,P,32,S1,Guru,kawin,Pamulang,5500000.0,dewasa
11,3201010012,Yuni Kartika,P,29,S1,HRD,kawin,Pamulang,6000000.0,dewasa muda
5,3201010006,Lina Hartati,P,28,D3,Perawat,kawin,Pamulang,4800000.0,dewasa muda
0,3201010001,Andi Saputra,L,25,SMA,Karyawan Swasta,kawin,Ciputat,3500000.0,dewasa muda
10,3201010011,Hendra Wijaya,L,22,SMA,Mahasiswa,kawin,Serpong,4000000.0,dewasa muda
3,3201010004,Rina Marlina,P,19,SMA,Mahasiswa,kawin,Ciputat,5000000.0,dewasa muda
7,3201010008,Nurul Fitri,P,16,SMP,Pelajar,belum lawin,Serpong,NaN,anak

In [ ]:
#filtering data
def filter_data(usia):
    if usia >=18:
        return "kawin"
    else:
        return "belum lawin"
df['status'] = df['usia'].apply(filter_data)

In [59]:
#jumlah kecamatan
jumlah_kecamatan = df["kecamatan"].value_counts()
print(jumlah_kecamatan)

kecamatan
Ciputat     4
Pamulang    4
Serpong     4
Name: count, dtype: int64

In [60]:
#kelompok usia
def kelompok(usia):
    if usia<=17:
        return 'anak'
    elif usia<=30:
        return 'dewasa muda'
    elif usia<=50:
        return 'dewasa'
    else:
        return 'lansia'
df['umur'] = df['usia'].apply(kelompok)
print(df)

           nik            nama gender  usia pendidikan        pekerjaan  \
0   3201010001    Andi Saputra      L    25        SMA  Karyawan Swasta
1   3201010002     Siti Aisyah      P    32         S1             Guru
2   3201010003    Budi Santoso      L    45        SMA       Wiraswasta
3   3201010004    Rina Marlina      P    19        SMA        Mahasiswa
4   3201010005  Dedi Kurniawan      L    52         S1              PNS
5   3201010006    Lina Hartati      P    28         D3          Perawat
6   3201010007  Rahmat Hidayat      L    35        SMA            Sopir
7   3201010008     Nurul Fitri      P    16        SMP          Pelajar
8   3201010009    Agus Pratama      L    60        SMA        Pensiunan
9   3201010010    Dewi Lestari      P    41         S2            Dosen
10  3201010011   Hendra Wijaya      L    22        SMA        Mahasiswa
11  3201010012    Yuni Kartika      P    29         S1              HRD

         status kecamatan  penghasilan         umur
0         kawin   Ciputat    3500000.0  dewasa muda
1         kawin  Pamulang    5500000.0       dewasa
2         kawin   Serpong    7000000.0       dewasa
3         kawin   Ciputat    5000000.0  dewasa muda
4         kawin   Serpong    8500000.0       lansia
5         kawin  Pamulang    4800000.0  dewasa muda
6         kawin   Ciputat    4000000.0       dewasa
7   belum lawin   Serpong          NaN         anak
8         kawin  Pamulang    3000000.0       lansia
9         kawin   Ciputat    9000000.0       dewasa
10        kawin   Serpong    4000000.0  dewasa muda
11        kawin  Pamulang    6000000.0  dewasa muda